rails/app/controllers/levels_controller.rb

SELECT "levels".* FROM "levels"
---
  def index
    @levels = Level.all

SELECT "levels".* FROM "levels" WHERE ("levels"."id" = 1) LIMIT 1
---
  def show
    @level = Level.find(params[:id])

SELECT "levels".* FROM "levels" WHERE ("levels"."id" = 1) LIMIT 1
---
  def edit
    @level = Level.find(params[:id])

INSERT INTO "levels" ("title", "data", "user_id", "created_at", "updated_at") VALUES ('Test', 'NO DATA', NULL, '2010-12-22 02:28:58.875914', '2010-12-22 02:28:58.875914')
---
  def create
    @level = Level.new(params[:level])
    @level.user_id = params[:level][:user_id]

    if @level.save